# Flipped Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wall..::..Flipped Property
Wall Class See Also
---
Property to test whether the wall orientation is flipped.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Flipped { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Flipped As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Flipped {
	bool get ();
}
```

# See Also
Wall Class
Autodesk.Revit.DB Namespace